jpnorair/OpenTag/include/board/stm32l1xx/board_IKR001.h
/*  Copyright 2008-2022, JP Norair
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright 
  *    notice, this list of conditions and the following disclaimer in the 
  *    documentation and/or other materials provided with the distribution.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE 
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE 
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
  * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
  * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS 
  * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
  * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
  * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE 
  * POSSIBILITY OF SUCH DAMAGE.
  */
/**
  * @file       /board/stm32l1xx/board_IKR001.h
  * @author     JP Norair
  * @version    R102
  * @date       29 Aug 2014
  * @brief      Board Configuration for STEVAL-IKR001
  * @ingroup    Platform
  *
  * SPECIAL NOTE: search for "note BOARD Macro" lines in this file.  These
  * must be ported to other STM32L boards, because the OpenTag STM32L platform 
  * implementation depends on them.
  *
  ******************************************************************************
  */
  

#ifndef __board_IKR001_H
#define __board_IKR001_H

/// MCU definition for the board must be the first thing
#define __STM32L152VB__

#include <app/app_config.h>
#include <platform/hw/STM32L1xx_config.h>
#include <platform/interrupts.h>

#ifdef __NULL_RADIO__
#   include <io/null_radio/config.h>
#else
#   define __SPIRIT1__
#   include <io/spirit1/config.h>
#endif



/// Macro settings: ENABLED, DISABLED, NOT_AVAILABLE
#ifdef ENABLED
#   undef ENABLED
#endif
#define ENABLED  1

#ifdef DISABLED
#   undef DISABLED
#endif
#define DISABLED  0

#ifdef NOT_AVAILABLE
#   undef NOT_AVAILABLE
#endif
#define NOT_AVAILABLE   DISABLED




/** Additional RF Front End Parameters and Settings <BR>
  * ========================================================================<BR>
  * The IKR001V3 uses 433 MHz band SPIRIT1 Module and a really poorly-matched
  * included antenna.  The included antenna is about 25% effcient, so we use 
  * 6 dB attenuation figure for RX and 7 dB attenuation for TX.  You can 
  * alternatively use a better antenna, which I have as 2 dB attentuation. 
  */
#define RF_PARAM_BAND       433
//#define RF_BASE_ATTEN           2
#define RF_BASE_ATTEN       6
#define RF_HDB_ATTEN        (2*(RF_BASE_ATTEN+1))   //Half dB attenuation (units = 0.5dB), used to scale TX power
#define RF_HDB_RXATTEN      (2*RF_BASE_ATTEN)       //Half dB attenuation for RX
#define RF_RSSI_OFFSET      (2*RF_BASE_ATTEN)       //Offset applied to RSSI calculation



/** MCU Configuration settings      <BR>
  * ========================================================================<BR>
  * Implemented capabilities of the STM32L variants on this board/build
  */
#define MCU_CONFIG(VAL)                 MCU_CONFIG_##VAL   // FEATURE 
#define MCU_CONFIG_MULTISPEED           DISABLED         // Allows usage of MF-HF clock boosting
#define MCU_CONFIG_MAPEEPROM            DISABLED
#define MCU_CONFIG_MPIPECDC             ENABLED                               // USB-CDC MPipe implementation
#define MCU_CONFIG_MPIPEUART            (MCU_CONFIG_MPIPECDC != ENABLED)       // UART MPipe Implementation
#define MCU_CONFIG_MPIPEI2C             DISABLED        // I2C MPipe Implementation
#define MCU_CONFIG_MEMCPYDMA            ENABLED         // MEMCPY DMA should be lower priority than MPIPE DMA
#define MCU_CONFIG_USB                  ((MCU_CONFIG_MPIPECDC == ENABLED) || 0)
#define MCU_CONFIG_VOLTLEVEL            2               // 3=1.2, 2=1.5V, 1=1.8V




/** Platform Memory Configuration <BR>
  * ========================================================================<BR>
  * OpenTag needs to know where it can put Nonvolatile memory (file system) and
  * how much space it can allocate for filesystem.  For this configuration, 
  * Veelite is put into FLASH.
  *
  * The STM32L uses 256 byte Flash pages and 4KB Flash sectors.  Therefore, it
  * is best to allocate the FS in Flash on 4KB boundaries because this is the 
  * resolution that can be write protected (or, as with FS, *NOT* write 
  * protected).  Best practice with STM32 chips is to put the FS at the back of
  * of the Flash space because this seems to work best with the debugger HW.
  */

#define SRAM_AVAILABLE               (16*1024)
#define EEPROM_AVAILABLE             (4*1024)
//#define FLASH_AVAILABLE              (64*1024)   //chip actually has 128KB
#define EEPROM_SAVE_SIZE        (64)

// EEPROM LOCAL DATA
#define EEPROM_LOCAL_ADDR       (EEPROM_START_ADDR + EEPROM_AVAILABLE - EEPROM_SAVE_SIZE)
#define EEPROM_LOCAL_U8         (ot_u8*)EEPROM_LOCAL_ADDR
#define EEPROM_LOCAL_U16        (ot_u16*)EEPROM_LOCAL_ADDR
#define EEPROM_LOCAL_U32        (ot_u32*)EEPROM_LOCAL_ADDR

// Using EEPROM: Pages figure is irrelevant
#define FLASH_NUM_PAGES         (FLASH_AVAILABLE/FLASH_PAGE_SIZE)
#define FLASH_FS_ADDR           (EEPROM_START_ADDR)
#define FLASH_FS_PAGES          0
#define FLASH_FS_FALLOWS        0 
#define FLASH_FS_ALLOC          (EEPROM_AVAILABLE) 






/** Board-based Feature Settings <BR>
  * ========================================================================<BR>
  * 1. There are 3 buttons, all active low, and all with external pullups
  *    <LI> SW1: goes to SCM_PS input </LI>
  *    <LI> SW3: goes to Reset input </LI>
  *    <LI> SW2: goes to "Push Button" input </LI>
  * 
  * 2. There is a 5-way active low joystick: right, down, center, up, left.
  *
  * 3. There are 5 active low LEDs: green, orange, red, blue, yellow
  * 
  * 4. The SPIRIT1 SPI benefits from the highest speed clock up to 20 MHz.
  */
#define BOARD_FEATURE(VAL)              BOARD_FEATURE_##VAL
#define BOARD_PARAM(VAL)                BOARD_PARAM_##VAL

