jpnorair/OpenTag/include/board/stm32l1xx/board_IKR001.h
#define BOARD_FEATURE_SWITCHES          ENABLED
#define BOARD_FEATURE_MPIPE             ENABLED
#define BOARD_FEATURE_USBCONVERTER      ENABLED                 // Is UART connected via USB converter?
#define BOARD_FEATURE_MPIPE_DIRECT      ENABLED
#define BOARD_FEATURE_MPIPE_BREAK       DISABLED                 // Send/receive leading break for wakeup
#define BOARD_FEATURE_MPIPE_CS          DISABLED                 // Chip-Select / DTR wakeup control 
#define BOARD_FEATURE_MPIPE_FLOWCTL     DISABLED                 // RTS/CTS style flow control

#define BOARD_FEATURE_UART              ENABLED
#define BOARD_FEATURE_I2C               (DISABLED || MCU_CONFIG_MPIPEI2C)
#define BOARD_FEATURE_LED               (!defined(__RELEASE__))

#define BOARD_FEATURE_LFXTAL            ENABLED                  // LF XTAL attached
#define BOARD_FEATURE_HFXTAL            DISABLED                 // Use HF XTAL ... might need to for USB, check back
#define BOARD_FEATURE_HFBYPASS          DISABLED
#define BOARD_FEATURE_RFXTAL            ENABLED                  // XTAL for RF chipset
#define BOARD_FEATURE_RFXTALOUT         DISABLED
#define BOARD_FEATURE_PLL               MCU_CONFIG_USB
#define BOARD_FEATURE_STDSPEED          DISABLED
#define BOARD_FEATURE_FULLSPEED         (MCU_CONFIG_USB != ENABLED)
#define BOARD_FEATURE_FULLXTAL          DISABLED
#define BOARD_FEATURE_FLANKSPEED        MCU_CONFIG_USB
#define BOARD_FEATURE_FLANKXTAL         MCU_CONFIG_USB
#define BOARD_FEATURE_INVERT_TRIG1      ENABLED
#define BOARD_FEATURE_INVERT_TRIG2      ENABLED

#define BOARD_PARAM_TRIGS               4
#define BOARD_PARAM_LFHz                32768
#define BOARD_PARAM_LFtol               0.00002
#define BOARD_PARAM_MFHz                4200000
#define BOARD_PARAM_MFmult              1                       // Main CLK = HFHz * (MFmult/MFdiv)
#define BOARD_PARAM_MFdiv               1
#define BOARD_PARAM_MFtol               0.02
#define BOARD_PARAM_HFHz                16000000
#define BOARD_PARAM_HFmult              1                       // Turbo CLK = HFHz * (HFmult/HFdiv)
#define BOARD_PARAM_HFdiv               1
#define BOARD_PARAM_HFtol               0.02
#define BOARD_PARAM_HFppm               20000
#define BOARD_PARAM_RFHz                50000000
#define BOARD_PARAM_RFdiv               3
#define BOARD_PARAM_RFout               (BOARD_PARAM_RFHz/BOARD_PARAM_RFdiv)
#define BOARD_PARAM_RFtol               0.00003
#define BOARD_PARAM_PLLout              96000000
#define BOARD_PARAM_PLLmult             (BOARD_PARAM_PLLout/8000000)
#define BOARD_PARAM_PLLdiv              3
#define BOARD_PARAM_PLLHz               (BOARD_PARAM_PLLout/BOARD_PARAM_PLLdiv)

// Standard & Full-Speed clocks (Flank halves APB2, APB1 settings)
#define BOARD_PARAM_AHBCLKDIV           1                       // AHB Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB2CLKDIV          1                       // APB2 Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB1CLKDIV          1                       // APB1 Clk = Main CLK / AHBCLKDIV

// JTAG Interface
#define BOARD_JTMS_PORT                 GPIOA
#define BOARD_JTMS_PINNUM               13
#define BOARD_JTMS_PIN                  (1<<13)
#define BOARD_SWDIO_PORT                BOARD_JTMS_PORT
#define BOARD_SWDIO_PINNUM              BOARD_JTMS_PINNUM
#define BOARD_SWDIO_PIN                 BOARD_JTMS_PIN
#define BOARD_JTCK_PORT                 GPIOA
#define BOARD_JTCK_PINNUM               14
#define BOARD_JTCK_PIN                  (1<<14)
#define BOARD_SWCLK_PORT                BOARD_JTCK_PORT
#define BOARD_SWCLK_PINNUM              BOARD JTCK_PINNUM
#define BOARD_SWCLK_PIN                 BOARD_JTCK_PIN
#define BOARD_JTDI_PORT                 GPIOA
#define BOARD_JTDI_PINNUM               15
#define BOARD_JTDI_PIN                  (1<<15)
#define BOARD_JTDO_PORT                 GPIOB
#define BOARD_JTDO_PINNUM               3
#define BOARD_JTDO_PIN                  (1<<3)
#define BOARD_TRACESWO_PORT             BOARD_JTDO_PORT
#define BOARD_TRACESWO_PINNUM           BOARD_JTDO_PINNUM
#define BOARD_TRACESWO_PIN              BOARD_JTDO_PIN
#define BOARD_JTDNRST_PORT              GPIOB
#define BOARD_JTDNRST_PINNUM            4
#define BOARD_JTDNRST_PIN               (1<<4)

// Pushbutton interface
#define BOARD_SW1_PORTNUM               2                   // Port C
#define BOARD_SW1_PORT                  GPIOC
#define BOARD_SW1_PINNUM                6
#define BOARD_SW1_PIN                   (1<<6)
#define BOARD_SW1_POLARITY              0
#define BOARD_SW1_PULLING               0

#define BOARD_SW2_PORTNUM               -1                  //Reset
#define BOARD_SW2_PORT                  -1
#define BOARD_SW2_PINNUM                -1
#define BOARD_SW2_PIN                   -1
#define BOARD_SW2_POLARITY              0
#define BOARD_SW2_PULLING               1

#define BOARD_SW3_PORTNUM               4                   // Port E
#define BOARD_SW3_PORT                  GPIOE
#define BOARD_SW3_PINNUM                9
#define BOARD_SW3_PIN                   (1<<9)
#define BOARD_SW3_POLARITY              0
#define BOARD_SW3_PULLING               0

// Joystick Interface
#define BOARD_JOYR_PORTNUM              1                   // Port B
#define BOARD_JOYR_PORT                 GPIOB
#define BOARD_JOYR_PINNUM               1
#define BOARD_JOYR_PIN                  (1<<1)
#define BOARD_JOYR_POLARITY             0
#define BOARD_JOYR_PULLING              0

#define BOARD_JOYD_PORTNUM              1                   // Port B
#define BOARD_JOYD_PORT                 GPIOB
#define BOARD_JOYD_PINNUM               0
#define BOARD_JOYD_PIN                  (1<<0)
#define BOARD_JOYD_POLARITY             0
#define BOARD_JOYD_PULLING              0

#define BOARD_JOYC_PORTNUM              4                   // Port E
#define BOARD_JOYC_PORT                 GPIOE
#define BOARD_JOYC_PINNUM               7
#define BOARD_JOYC_PIN                  (1<<7)
#define BOARD_JOYC_POLARITY             0
#define BOARD_JOYC_PULLING              0

#define BOARD_JOYU_PORTNUM              4                   // Port E
#define BOARD_JOYU_PORT                 GPIOE
#define BOARD_JOYU_PINNUM               8
#define BOARD_JOYU_PIN                  (1<<8)
#define BOARD_JOYU_POLARITY             0
#define BOARD_JOYU_PULLING              0

#define BOARD_JOYL_PORTNUM              4                   // Port E
#define BOARD_JOYL_PORT                 GPIOE
#define BOARD_JOYL_PINNUM               6
#define BOARD_JOYL_PIN                  (1<<6)
#define BOARD_JOYL_POLARITY             0
#define BOARD_JOYL_PULLING              0

// LED interface
#define BOARD_LEDG_PORTNUM              3                   // Port D
#define BOARD_LEDG_PORT                 GPIOD
#define BOARD_LEDG_PINNUM               0
#define BOARD_LEDG_PIN                  (1<<BOARD_LEDG_PINNUM)
#define BOARD_LEDG_POLARITY             0

#define BOARD_LEDO_PORTNUM              3                   // Port D
#define BOARD_LEDO_PORT                 GPIOD
#define BOARD_LEDO_PINNUM               1
#define BOARD_LEDO_PIN                  (1<<BOARD_LEDO_PINNUM)
#define BOARD_LEDO_POLARITY             0

