jpnorair/OpenTag/include/board/stm32l1xx/board_IKR001.h
#define BOARD_LEDR_PORTNUM              3                   // Port D
#define BOARD_LEDR_PORT                 GPIOD
#define BOARD_LEDR_PINNUM               2
#define BOARD_LEDR_PIN                  (1<<BOARD_LEDR_PINNUM)
#define BOARD_LEDR_POLARITY             0

#define BOARD_LEDB_PORTNUM              3                   // Port D
#define BOARD_LEDB_PORT                 GPIOD
#define BOARD_LEDB_PINNUM               3   
#define BOARD_LEDB_PIN                  (1<<BOARD_LEDB_PINNUM)
#define BOARD_LEDB_POLARITY             0

#define BOARD_LEDY_PORTNUM              3                   // Port D
#define BOARD_LEDY_PORT                 GPIOD
#define BOARD_LEDY_PINNUM               4
#define BOARD_LEDY_PIN                  (1<<BOARD_LEDY_PINNUM)
#define BOARD_LEDY_POLARITY             0

// Analog Input BNC
#define BOARD_BNC_PORTNUM               0
#define BOARD_BNC_PORT                  GPIOA
#define BOARD_BNC_PINNUM                5
#define BOARD_BNC_PIN                   (1<<5)

// Analog Voltage Sensing
#define BOARD_VSENSE_PORTNUM            2
#define BOARD_VSENSE_PORT               GPIOC
#define BOARD_VSENSE_5VPINNUM           5
#define BOARD_VSENSE_3VPINNUM           4
#define BOARD_VSENSE_5VPIN              (1<<5)
#define BOARD_VSENSE_3VPIN              (1<<4)

// External UART interface on USART2
#define BOARD_UART_ID                   2                   // USART2
#define BOARD_UART_PORTNUM              0                   // Port A
#define BOARD_UART_PORT                 GPIOA
#define BOARD_UART_CTSPINNUM            0
#define BOARD_UART_RTSPINNUM            1
#define BOARD_UART_TXPINNUM             2
#define BOARD_UART_RXPINNUM             3
#define BOARD_UART_CTSPIN               (1<<0)
#define BOARD_UART_RTSPIN               (1<<1)
#define BOARD_UART_TXPIN                (1<<2)
#define BOARD_UART_RXPIN                (1<<3)

// External USB interface
#define BOARD_USB_PORTNUM               0
#define BOARD_USB_PORT                  GPIOA
#define BOARD_USB_DMPINNUM              11
#define BOARD_USB_DPPINNUM              12
#define BOARD_USB_DMPIN                 (1<<11)
#define BOARD_USB_DPPIN                 (1<<12)

// Accelerometer Interface on I2C2
#define BOARD_ACC_PORTNUM               1
#define BOARD_ACC_PORT                  GPIOB
#define BOARD_ACC_INT1PINNUM            8
#define BOARD_ACC_INT2PINNUM            9
#define BOARD_ACC_SCLPINNUM             10
#define BOARD_ACC_SDAPINNUM             11
#define BOARD_ACC_INT1PIN               (1<<8)
#define BOARD_ACC_INT2PIN               (1<<9)
#define BOARD_ACC_SCLPIN                (1<<10)
#define BOARD_ACC_SDAPIN                (1<<11)

// LCD Interface on SPI2
// LCD Card interface cannot be utilized, because TIM9 is required
//#define BOARD_LCDBL_PORTNUM             0
//#define BOARD_LCDBL_PORT                GPIOA
//#define BOARD_LCDBL_PINNUM              9
//#define BOARD_LCDBL_PIN                 (1<<9)
//#define BOARD_LCDRESETN_PORTNUM         4
//#define BOARD_LCDRESETN_PORT            GPIOE
//#define BOARD_LCDRESETN_PINNUM          10
//#define BOARD_LCDRESETN_PIN             (1<<10)
//#define BOARD_LCDSPI_PORTNUM            1
//#define BOARD_LCDSPI_PORT               GPIOB
//#define BOARD_LCDSPI_MOSIPINNUM         15
//#define BOARD_LCDSPI_MISOPINNUM         14
//#define BOARD_LCDSPI_SCLKPINNUM         13
//#define BOARD_LCDSPI_CSNPINNUM          12
//#define BOARD_LCDSPI_MOSIPIN            (1<<15)
//#define BOARD_LCDSPI_MISOPIN            (1<<14)
//#define BOARD_LCDSPI_SCLKPIN            (1<<13)
//#define BOARD_LCDSPI_CSNPIN             (1<<12)

// SD Card interface (shares SPI2)
// SD Card interface cannot be utilized, because TIM9 is required
//#define BOARD_SDCSN_PORTNUM             0
//#define BOARD_SDCSN_PORT                GPIOA
//#define BOARD_SDCSN_PINNUM              8
//#define BOARD_SDCSN_PIN                 (1<<8)
//#define BOARD_SDSPI_PORTNUM             1
//#define BOARD_SDSPI_PORT                GPIOB
//#define BOARD_SDSPI_MOSIPINNUM          15
//#define BOARD_SDSPI_MISOPINNUM          14
//#define BOARD_SDSPI_SCLKPINNUM          13
//#define BOARD_SDSPI_MOSIPIN             (1<<15)
//#define BOARD_SDSPI_MISOPIN             (1<<14)
//#define BOARD_SDSPI_SCLKPIN             (1<<13)

// SPIRIT1 RF interface
#define BOARD_RFGPIO_PORTNUM            2
#define BOARD_RFGPIO_PORT               GPIOC
#define BOARD_RFGPIO_0PINNUM            7
#define BOARD_RFGPIO_1PINNUM            8
#define BOARD_RFGPIO_2PINNUM            9
#define BOARD_RFCTL_PORTNUM             2
#define BOARD_RFCTL_PORT                GPIOC
#define BOARD_RFCTL_SDNPINNUM           13
#define BOARD_RFCTL_3PINNUM             10
#define BOARD_RFGPIO_0PIN               (1<<BOARD_RFGPIO_0PINNUM)
#define BOARD_RFGPIO_1PIN               (1<<BOARD_RFGPIO_1PINNUM)
#define BOARD_RFGPIO_2PIN               (1<<BOARD_RFGPIO_2PINNUM)
#define BOARD_RFCTL_3PIN                (1<<BOARD_RFCTL_3PINNUM)
#define BOARD_RFCTL_SDNPIN              (1<<BOARD_RFCTL_SDNPINNUM)
#define BOARD_RFSPI_ID                  1       //SPI1
#define BOARD_RFSPI_PORTNUM             4       //Port E
#define BOARD_RFSPI_PORT                GPIOE
#define BOARD_RFSPI_MOSIPINNUM          15
#define BOARD_RFSPI_MISOPINNUM          14
#define BOARD_RFSPI_SCLKPINNUM          13
#define BOARD_RFSPI_CSNPINNUM           12
#define BOARD_RFSPI_MOSIPIN             (1<<BOARD_RFSPI_MOSIPINNUM)
#define BOARD_RFSPI_MISOPIN             (1<<BOARD_RFSPI_MISOPINNUM)
#define BOARD_RFSPI_SCLKPIN             (1<<BOARD_RFSPI_SCLKPINNUM)
#define BOARD_RFSPI_CSNPIN              (1<<BOARD_RFSPI_CSNPINNUM)

// SPIRIT1 Current Montior (SCM) interface
#define BOARD_SCMIN_PORTNUM             2
#define BOARD_SCMIN_PORT                GPIOC
#define BOARD_SCMIN_PSPINNUM            6
#define BOARD_SCMIN_RFVPINNUM           3
#define BOARD_SCMIN_PSPIN               (1<<6)
#define BOARD_SCMIN_RFVPIN              (1<<3)
#define BOARD_SCMOUT_PORTNUM            4
#define BOARD_SCMOUT_PORT               GPIOE
#define BOARD_SCMOUT_SCMENPINNUM        4
#define BOARD_SCMOUT_CMENPINNUM         3
#define BOARD_SCMOUT_SCMENPIN           (1<<4)
#define BOARD_SCMOUT_CMENPIN            (1<<3)

// TIMER9 output interface: 
// You cannot use LCD or SD card with Timer 9
//#define BOARD_TIM9CH1_PORTNUM           1   //Port B
//#define BOARD_TIM9CH2_PORTNUM           1
//#define BOARD_TIM9CH1_PORT              GPIOB
//#define BOARD_TIM9CH2_PORT              GPIOB
//#define BOARD_TIM9CH1_PINNUM            13
//#define BOARD_TIM9CH2_PINNUM            14
//#define BOARD_TIM9CH1_PIN               (1<<13)
//#define BOARD_TIM9CH2_PIN               (1<<14)

// GPTIM wakeup interface: Uses loopback from Timer 9
//#define BOARD_GPTIM1_PORTNUM            1   //Port B
//#define BOARD_GPTIM2_PORTNUM            1   
//#define BOARD_GPTIM1_PORT               GPIOB
//#define BOARD_GPTIM2_PORT               GPIOB
//#define BOARD_GPTIM1_PINNUM             13
//#define BOARD_GPTIM2_PINNUM             14
//#define BOARD_GPTIM1_PIN                (1<<13)
//#define BOARD_GPTIM2_PIN                (1<<14)








/** BOARD Macros (most of them, anyway) <BR>
  * ========================================================================<BR>
  * BOARD Macros are required by the OpenTag STM32L platform implementation.
  * We can assume certain things at the platform level, but not everything,
  * which is why BOARD Macros are required.
  *
  * If your board is implementing a radio (extremely likely), there are likely
  * some additional Board macros down near the radio configuration section.
  */
// DMA is used in MEMCPY and thus it could be needed at any time during
// active runtime.  So, the active-clock must be enabled permanently.
#if (MCU_CONFIG_MEMCPYDMA)
#   define _DMACLK_N    RCC_AHBENR_DMA1EN
#else
#   define _DMACLK_N    0
#   define _DMACLK_DYNAMIC
#endif

//Flash should be enabled unless you seriously modify OpenTag.
#define _FLITFCLK_N      RCC_AHBENR_FLITFEN

//The built-in CRC engine is rarely used, start disabled
#define _CRCCLK_N        0   //RCC_AHBENR_CRCEN

