jpnorair/OpenTag/include/board/stm32l1xx/board_IKR001.h
// This board uses all GPIOs it has (GPIOA-E), so enable all of them.  
// You could optimize this if you aren't using them all.
#define _GPIOCLK_SU     (   RCC_AHBENR_GPIOAEN  \
                        |   RCC_AHBENR_GPIOBEN  \
                        |   RCC_AHBENR_GPIOCEN  \
                        |   RCC_AHBENR_GPIODEN  \
                        |   RCC_AHBENR_GPIOEEN  )
#define _GPIOCLK_N      _GPIOCLK_SU

// DMA will be enabled in Sleep on demand by the device driver.  By default
// it is disabled in sleep
#define _DMACLK_LP   RCC_AHBLPENR_DMA1LPEN
//#define _DMACLK_DYNAMIC_LP

// SRAM should always be clocked during SLEEP
#define _SRAMCLK_LP      RCC_AHBLPENR_SRAMLPEN

// FLASH needs to be clocked during LP modes, such as if you are sending
// constant data from Flash across a DMA+Peripheral.  We assume this is the
// case.  In any case, the supply current hit is negligible.
#define _FLITFCLK_LP     RCC_AHBLPENR_FLITFLPEN

// HW CRC32 engine is never used in sleep, or much at all, so fuck it
#define _CRCCLK_LP       0       //RCC_AHBLPENR_CRCLPEN

// I assume that all GPIOs could have interrupts, so I enable them all in
// sleep.  You could optimize this if you are not using some peripherals.
#define _GPIOCLK_LP     (   RCC_AHBLPENR_GPIOALPEN  \
                        |   RCC_AHBLPENR_GPIOBLPEN  \
                        |   RCC_AHBLPENR_GPIOCLPEN  \
                        |   RCC_AHBLPENR_GPIODLPEN  \
                        |   RCC_AHBLPENR_GPIOELPEN  )

#define _AHBENR_STARTUP  (_DMACLK_N | _FLITFCLK_N | _CRCCLK_N | _GPIOCLK_SU)
#define _AHBENR_RUNTIME  (_DMACLK_N | _FLITFCLK_N | _CRCCLK_N | _GPIOCLK_N)


//@note BOARD Macro for Peripheral Clock initialization at startup
static inline void BOARD_PERIPH_INIT(void) {
    //1. AHB Clock Setup for Active Mode
    RCC->AHBENR    = _AHBENR_STARTUP;

    // 1b. AHB Clock Setup for Sleep Mode
    RCC->AHBLPENR  = (_DMACLK_LP | _SRAMCLK_LP | _FLITFCLK_LP | _CRCCLK_LP | _GPIOCLK_LP);

    // 2. APB2 Clocks in Active Mode.  APB2 is the high-speed peripheral bus.  
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  SYSCFG is the exception.
    // USART1, SPI1, ADC1, TIM11, TIM10, TIM9, SYSCFG.
#   ifdef __DEBUG__
    RCC->APB2ENR   = (RCC_APB2ENR_TIM9EN | RCC_APB2ENR_SYSCFGEN);
#   else
    RCC->APB2ENR   = (RCC_APB2ENR_TIM10EN | RCC_APB2ENR_SYSCFGEN);
#   endif

    // 3. APB1 Clocks in Active Mode.  APB1 is the low-speed peripheral bus.
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  PWR is the exception.
    // COMP, DAC, PWR, USB, I2C2, I2C1, USART3, USART2, SPI2, WWDG, LCD, TIM7,
    // TIM6, TIM4, TIM3, TIM2
    RCC->APB1ENR   = (RCC_APB1ENR_PWREN); 
}



///@note BOARD Macro for EXTI initialization.  See also EXTI macros at the
///      bottom of the page.
static inline void BOARD_EXTI_STARTUP(void) {
    // EXTI0-3: Unused, Unused, Unused, UART-RX-Detect
#   if (BOARD_FEATURE(MPIPE_BREAK))
    SYSCFG->EXTICR[0]   = (BOARD_UART_PORTNUM << 12);
#   endif
    
    // EXTI4-7: Unused, Unused, SW1, RFGPIO0
    SYSCFG->EXTICR[1]   = (BOARD_SW1_PORTNUM << 8) \
                        | (BOARD_RFGPIO_PORTNUM << 12);
    
    // EXTI8-11: RFGPIO1, RFGPIO2, Unused, Unused
    SYSCFG->EXTICR[2]   = ( (BOARD_RFGPIO_PORTNUM << 0) \
                        | (BOARD_RFGPIO_PORTNUM << 4));
    
    // EXTI12-15: Unused, Unused, Unused, Unused
    //SYSCFG->EXTICR[3]  |= 
}



///@note BOARD Macro for initializing GPIO ports at startup, pursuant to the
///      connections in the schematic of this board.  This funciotn
static inline void BOARD_PORT_STARTUP(void) {
    
    // JTAG/SWD Interface: Set to Output-GND unless in DEBUG mode
#   if defined(__RELEASE__)
    BOARD_JTMS_PORT->MODER |= ( (GPIO_MODER_OUT << (BOARD_JTMS_PINNUM*2)) \
                              | (GPIO_MODER_OUT << (BOARD_JTCK_PINNUM*2)) \
                              | (GPIO_MODER_OUT << (BOARD_JTDI_PINNUM*2)) );
    
    BOARD_JTDO_PORT->MODER |= ( (GPIO_MODER_OUT << (BOARD_JTDO_PINNUM*2)) \
                              | (GPIO_MODER_OUT << (BOARD_JTDNRST_PINNUM*2)) );
#   endif 
    
    
    // Pushbutton Interface: Set to floating inputs (defaults for this config)
    //BOARD_SW1_PORT->MODER  &= ~(3 << (BOARD_SW1_PINNUM*2));
    //BOARD_SW1_PORT->PUPDR  &= ~(3 << (BOARD_SW1_PINNUM*2));
    
    
    // Joystick Interface: Set to floating inputs (defaults for this config)
    //BOARD_JOYR_PORT->MODER &= ~(  (3 << (BOARD_JOYR_PINNUM*2))   \
                                  | (3 << (BOARD_JOYD_PINNUM*2))   );
    //BOARD_JOYR_PORT->PUPDR &= ~(  (3 << (BOARD_JOYR_PINNUM*2))   \
                                  | (3 << (BOARD_JOYD_PINNUM*2))   );
    //BOARD_JOYC_PORT->MODER &= ~(  (3 << (BOARD_JOYC_PINNUM*2))   \
                                  | (3 << (BOARD_JOYU_PINNUM*2))   \
                                  | (3 << (BOARD_JOYL_PINNUM*2))   );
    //BOARD_JOYC_PORT->PUPDR &= ~(  (3 << (BOARD_JOYC_PINNUM*2))   \
                                  | (3 << (BOARD_JOYU_PINNUM*2))   \
                                  | (3 << (BOARD_JOYL_PINNUM*2))   );


    // LED interface: Set to output open drain, with default at logic 1
    BOARD_LEDG_PORT->OTYPER    |= BOARD_LEDG_PIN | BOARD_LEDO_PIN \
                                | BOARD_LEDR_PIN | BOARD_LEDB_PIN \
                                | BOARD_LEDY_PIN;
    BOARD_LEDG_PORT->BSRRL     |= BOARD_LEDG_PIN | BOARD_LEDO_PIN \
                                | BOARD_LEDR_PIN | BOARD_LEDB_PIN \
                                | BOARD_LEDY_PIN;                     
    BOARD_LEDG_PORT->MODER     |= (1 << (BOARD_LEDG_PINNUM*2))   \
                                | (1 << (BOARD_LEDO_PINNUM*2))   \
                                | (1 << (BOARD_LEDR_PINNUM*2))   \
                                | (1 << (BOARD_LEDB_PINNUM*2))   \
                                | (1 << (BOARD_LEDY_PINNUM*2));
    
    
    // Analog Input BNC: Set to analog input on this pin (Port A)
    BOARD_BNC_PORT->MODER  |= (GPIO_MODER_AN << (BOARD_BNC_PINNUM*2));
    
    
    // Analog Input for Voltage Sense: (Port C)
    BOARD_VSENSE_PORT->MODER   |= ( (GPIO_MODER_AN << (BOARD_VSENSE_5VPINNUM*2))   \
                                  | (GPIO_MODER_AN << (BOARD_VSENSE_3VPINNUM*2))   );  //Port C
    
    
    // External UART on USART2 (Port A).  RTS/CTS flow control always disabled.
    // RX pin and CTS use input pull-down, TX pin uses push-pull output
    // CTS and RTS are conducted in SW, if enabled.
#   if (MCU_CONFIG(MPIPEUART) == ENABLED)
        BOARD_UART_PORT->PUPDR |= (2 << (BOARD_UART_RXPINNUM*2)) \
                                | (2 << (BOARD_UART_CTSPINNUM*2));
        BOARD_UART_PORT->MODER |= (GPIO_MODER_OUT << (BOARD_UART_CTSPINNUM*2)) \
                                | (GPIO_MODER_OUT << (BOARD_UART_RTSPINNUM*2)) \
                                | (GPIO_MODER_ALT << (BOARD_UART_RXPINNUM*2))  \
                                | (GPIO_MODER_ALT << (BOARD_UART_TXPINNUM*2));
        BOARD_UART_PORT->AFR[0]|= (7 << (BOARD_UART_RXPINNUM*4)) \
                               | (7 << (BOARD_UART_TXPINNUM*4));

    // External USB interface
    // - For some reason, USB only works if it is in startup-default when accessed
    //   by the USB library
    // - Make sure to disable Crystal on PortH when USB is not used
#   elif (MCU_CONFIG(MPIPECDC) == ENABLED)
      //GPIOH->MODER            = (GPIO_MODER_OUT << (0*2));
      //BOARD_USB_PORT->PUPDR  |= (1 << (BOARD_USB_DMPINNUM*2)) \
                                | (1 << (BOARD_USB_DPPINNUM*2));
        //BOARD_USB_PORT->AFR[1] |= (10 << ((BOARD_USB_DMPINNUM-8)*4))  \
                                | (10 << ((BOARD_USB_DPPINNUM-8)*4));
      //BOARD_USB_PORT->OTYPER |= (BOARD_USB_DMPINNUM | BOARD_USB_DPPINNUM);
        //BOARD_USB_PORT->OSPEEDR|= (GPIO_OSPEEDR_40MHz << (BOARD_USB_DMPINNUM*2)) \
                                | (GPIO_OSPEEDR_40MHz << (BOARD_USB_DPPINNUM*2));
      //BOARD_USB_PORT->MODER  |= (GPIO_MODER_ALT << (BOARD_USB_DMPINNUM*2)) \
                                | (GPIO_MODER_ALT << (BOARD_USB_DPPINNUM*2));
#   else
        GPIOH->MODER            = ( (GPIO_MODER_OUT << (0*2)) | (GPIO_MODER_OUT << (1*2)) \
                                  | (GPIO_MODER_OUT << (2*2)) );
#   endif
    
    
