jpnorair/OpenTag/include/board/stm32l1xx/board_IKR001.h
    // Accelerometer Interface using I2C2 (Port B)
    BOARD_ACC_PORT->OTYPER     |= ( (1<<BOARD_ACC_SCLPINNUM) | (1<<BOARD_ACC_SDAPINNUM) );    //Open Drain
    BOARD_ACC_PORT->OSPEEDR    |= ( (GPIO_OSPEEDR_2MHz << (BOARD_ACC_SCLPINNUM*2)) \
                                  | (GPIO_OSPEEDR_2MHz << (BOARD_ACC_SDAPINNUM*2)) );
    BOARD_ACC_PORT->MODER      |= ( (GPIO_MODER_ALT << (BOARD_ACC_SCLPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_ACC_SDAPINNUM*2)) );
#   if ((BOARD_ACC_SCLPINNUM >= 8) && (BOARD_ACC_SDAPINNUM >= 8))
        BOARD_ACC_PORT->AFR[1] |= ( (4 << ((BOARD_ACC_SCLPINNUM-8)*4))  \
                                  | (4 << ((BOARD_ACC_SDAPINNUM-8)*4))  );
#   else
#       error "I2C2 GPIO config missing"
#   endif
    
    
    // LCD interface on SPI 2 (currently disabled, set to output-gnd)
    //BOARD_LCDBL_PORT->MODER    |= (GPIO_MODER_OUT << (BOARD_LCDBL_PINNUM*2));
    //BOARD_LCDRESETN_PORT->MODER|= (GPIO_MODER_OUT << (BOARD_LCDRESETN_PINNUM*2));
    //BOARD_LCDSPI_PORT->MODER   |= ( (GPIO_MODER_OUT << (BOARD_LCDSPI_MOSIPINNUM*2)) \
                                  | (GPIO_MODER_OUT << (BOARD_LCDSPI_MISOPINNUM*2)) \
                                  | (GPIO_MODER_OUT << (BOARD_LCDSPI_SCLKPINNUM*2)) \
                                  | (GPIO_MODER_OUT << (BOARD_LCDSPI_CSNPINNUM*2)) );
    
    
    // SD Card Interface on SPI2 (currently disabled)
    // LCD interface above already disabled SPI2, so just disable SD CSn
    //BOARD_SDCSN_PORT->MODER    |= (GPIO_MODER_OUT << (BOARD_SDCSN_PINNUM*2));
    
    
    // SPIRIT1 RF Interface, using SPI1 and some GPIOs
    // - SDN is 2MHz push-pull output, which is asserted via BSRRL
    // - GPIO0-3 are HiZ inputs, which is the startup default condition
    // - SPI bus is ALT, MISO is pulldown, CS pin is push-pull output
    
    BOARD_RFCTL_PORT->MODER    |= (GPIO_MODER_OUT << (BOARD_RFCTL_SDNPINNUM*2));
    BOARD_RFCTL_PORT->OSPEEDR  |= (GPIO_OSPEEDR_2MHz << (BOARD_RFCTL_SDNPINNUM*2));
    BOARD_RFCTL_PORT->BSRRL     = BOARD_RFCTL_SDNPIN;
    
    //BOARD_RFGPIO_PORT->MODER	  |= 0;
    
    BOARD_RFSPI_PORT->BSRRL     = BOARD_RFSPI_CSNPIN;
    BOARD_RFSPI_PORT->AFR[1]   |= (5 << ((BOARD_RFSPI_MOSIPINNUM-8)*4)) \
                                  | (5 << ((BOARD_RFSPI_MISOPINNUM-8)*4)) \
                                  | (5 << ((BOARD_RFSPI_SCLKPINNUM-8)*4));
    BOARD_RFSPI_PORT->MODER    |= ( (GPIO_MODER_ALT << (BOARD_RFSPI_MOSIPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_RFSPI_MISOPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                                  | (GPIO_MODER_OUT << (BOARD_RFSPI_CSNPINNUM*2)) );
    BOARD_RFSPI_PORT->PUPDR    |= (2 << (BOARD_RFSPI_MOSIPINNUM*2));
    BOARD_RFSPI_PORT->OSPEEDR  |= ( (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_MOSIPINNUM*2)) \
                                  | (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_MISOPINNUM*2)) \
                                  | (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_SCLKPINNUM*2)) \
                                  | (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_CSNPINNUM*2)) );
    
    
    // SPIRIT1 Current Monitor Interface
    // PS input and RFV inputs are set by default
    /// does this need AFR config?
    BOARD_SCMOUT_PORT->MODER   |= ( (GPIO_MODER_ALT << (BOARD_SCMOUT_SCMENPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_SCMOUT_CMENPINNUM*2)) );
    
    
    // Set up all not-connected pins as output ground
    // PA4, PA6, PA7-10
    //GPIOA->MODER   |= ( (GPIO_MODER_OUT << (4*2)) | (GPIO_MODER_OUT << (6*2)) \
                      | (GPIO_MODER_OUT << (7*2)) | (GPIO_MODER_OUT << (8*2)) \
                      | (GPIO_MODER_OUT << (9*2)) | (GPIO_MODER_OUT << (10*2)) );
    // PB5
    //GPIOB->MODER   |= (GPIO_MODER_OUT << (5*2));
    
    // PD5-15 all NC
    //GPIOD->MODER   |= ( (GPIO_MODER_OUT << (5*2)) | (GPIO_MODER_OUT << (6*2)) \
                      | (GPIO_MODER_OUT << (7*2)) | (GPIO_MODER_OUT << (8*2)) \
                      | (GPIO_MODER_OUT << (9*2)) \
                      | (GPIO_MODER_OUT << (10*2))| (GPIO_MODER_OUT << (11*2)) \
                      | (GPIO_MODER_OUT << (12*2))| (GPIO_MODER_OUT << (13*2)) \
                      | (GPIO_MODER_OUT << (14*2))| (GPIO_MODER_OUT << (15*2)) );
    // PE0-2, 10-11 all NC
    //GPIOE->MODER   |= ( (GPIO_MODER_OUT << (0*2)) | (GPIO_MODER_OUT << (1*2)) \
                      | (GPIO_MODER_OUT << (2*2)) | (GPIO_MODER_OUT << (10*2)) \
                      | (GPIO_MODER_OUT << (11*2)) );
    
    /// Configure Port C IO.
    /// Port C for 32kHz crystal driving: update
    // - C13 is Attach Detect, a grounded output
    // - C14:15 are 32kHz crystal driving, set to ALT
    //GPIOC->MODER    = (GPIO_MODER_OUT << (13*2)) \
                    | (GPIO_MODER_OUT << (14*2)) \
                    | (GPIO_MODER_ALT << (15*2));
    
    // Certain ports get disabled for runtime (like GPIOH)
    RCC->AHBENR    = _AHBENR_RUNTIME;
}


//@note BOARD Macro for DMA peripheral enabling
static inline void BOARD_DMA_CLKON(void) {
#ifdef _DMACLK_DYNAMIC
    // DMA is not enabled for normal mode by default, so enable it
    RCC->AHBENR    |= RCC_AHBENR_DMA1EN;
#endif
#ifdef _DMACLK_DYNAMIC_LP
    // DMA is not enabled for low-power mode by default, so enable it
    RCC->AHBLPENR  |= RCC_AHBLPENR_DMA1LPEN;
#endif
}

static inline void BOARD_DMA_CLKOFF(void) {
#ifdef _DMACLK_DYNAMIC
    // DMA is not enabled for normal mode by default, so disable it
    RCC->AHBENR    &= ~RCC_AHBENR_DMA1EN;
#endif
#ifdef _DMACLK_DYNAMIC_LP
    // DMA is not enabled for low-power mode by default, so disable it
    RCC->AHBLPENR  &= ~RCC_AHBLPENR_DMA1LPEN;
#endif
}


static inline void BOARD_RFSPI_CLKON(void) {
	uint32_t moder;
	moder                      = BOARD_RFSPI_PORT->MODER;
	moder                     &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                                 | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                                 | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
	moder                     |= (GPIO_MODER_ALT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                               | (GPIO_MODER_ALT << (BOARD_RFSPI_MISOPINNUM*2)) \
                               | (GPIO_MODER_ALT << (BOARD_RFSPI_MOSIPINNUM*2));
    BOARD_RFSPI_PORT->MODER    = moder;
}

static inline void BOARD_RFSPI_CLKOFF(void) {
    uint32_t moder;
	moder                      = BOARD_RFSPI_PORT->MODER;
	moder                     &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                                 | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                                 | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
	moder                     |= (GPIO_MODER_OUT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                               | (GPIO_MODER_IN << (BOARD_RFSPI_MISOPINNUM*2)) \
                               | (GPIO_MODER_OUT << (BOARD_RFSPI_MOSIPINNUM*2));
    BOARD_RFSPI_PORT->MODER    = moder;
}


#include <platform/timers.h>    // for systim_stop_clocker()
static inline void BOARD_STOP(ot_int code) {
///@note IKR001 board is poorly designed for running in STOP mode, as three
///      ports must be kept-alive (B, C, E)
#   define _RF_GPIO     (RCC_AHBENR_GPIOCEN)
#   define _BUTTON_GPIO (RCC_AHBENR_GPIOBEN | RCC_AHBENR_GPIOCEN | RCC_AHBENR_GPIOEEN)
#   define _STOP3_GPIO  (_BUTTON_GPIO)
#   define _STOP2_GPIO  (_RF_GPIO | _BUTTON_GPIO)

/// code comes from sys_sig_powerdown, but it is usually 0-3.
/// For all STM32L devices, 3 is full-idle and 2 is radio-active-idle.  
/// Those are the only modes that should call this inline function.

    static const ot_u16 stop_flags[2] = {  
        (PWR_CR_LPSDSR | PWR_CR_CSBF), (PWR_CR_LPSDSR | PWR_CR_FWU | PWR_CR_ULP | PWR_CR_CSBF) };

