jpnorair/OpenTag/include/board/stm32l1xx/board_IKR001.h
#   if defined(__RELEASE__)
    static const ot_u32 rcc_flags[2] = { ~_STOP2_GPIO, ~_STOP3_GPIO };
#   endif

    ot_u16 scratch;
    
    code &= 1;
    
#   if defined(__RELEASE__)
        ///@todo: set pins not used in STOP to analog mode with no pullup/down
        //GPIOB->MODER    = 0xFFFFFFFF;
        //GPIOB->PUPDR    = 0;
        RCC->AHBENR    &= rcc_flags[code];
#   endif

    SysTick->CTRL = 0;
    SCB->SCR   |= SCB_SCR_SLEEPDEEP;
    scratch     = PWR->CR;
    scratch    &= ~(PWR_CR_DBP | PWR_CR_PDDS | PWR_CR_LPSDSR);
    scratch    |= stop_flags[code];
    PWR->CR     = scratch;
    
    EXTI->PR    = 0;
    systim_stop_clocker();
    platform_enable_interrupts();
    
    __WFI();
    
    // On Wakeup (from STOP) clear flags & re-enable backup register area
    PWR->CR |= (PWR_CR_DBP | PWR_CR_CWUF | PWR_CR_CSBF);
    
    // On wakeup, immediately reset SLEEPDEEP bit
    SCB->SCR &= ~((ot_u32)SCB_SCR_SLEEPDEEP);
    
    // Re-enable ports
#   if defined(__RELEASE__)
      RCC->AHBENR    |= (_STOP2_GPIO | _STOP3_GPIO);
      ///@todo: set pins not used in STOP to back to default mode & pulling
      //GPIOB->PUPDR    = GPIOB_PUPDR_DEFAULT;
      //GPIOB->MODER    = GPIOB_MODER_DEFAULT;
#   endif
}




static inline void BOARD_PORT_STANDBY() {
    // JTAG/SWD Interface: Keep Alive
    
    // Pushbutton Interface: Keep Alive
    
    // Joystick Interface: Keep Alive

    // LED interface: Keep Alive
    // LED usage will impact energy usage tremendously, so don't use LEDs in 
    // low-power apps. 
    
    // Analog Input BNC: Set to Hiz
    //# BOARD_BNC_PORT->MODER  |= (GPIO_MODER_AN << (BOARD_BNC_PINNUM*2));
    
    
    // Analog Input for Voltage Sense: Set to HiZ
    //# BOARD_VSENSE_PORT->MODER   |= ( (GPIO_MODER_AN << (BOARD_VSENSE_5VPINNUM*2))   \
                                  | (GPIO_MODER_AN << (BOARD_VSENSE_3VPINNUM*2))   );  //Port C
    
    
    // External UART on USART2 (Port A).  
    // Keep alive RTS/CTS, set RX/TX to HiZ
#   if ((OT_FEATURE_MPIPE == ENABLED) && (MCU_CONFIG_MPIPEUART == ENABLED))
        BOARD_UART_PORT->PUPDR |= (2 << (BOARD_UART_RTSPINNUM*2));
        BOARD_UART_PORT->MODER |= ( (GPIO_MODER_OUT << (BOARD_UART_CTSPINNUM*2)) \
                                  | (GPIO_MODER_IN  << (BOARD_UART_RTSPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_UART_RXPINNUM*2))  \
                                  | (GPIO_MODER_ALT << (BOARD_UART_TXPINNUM*2))  );
#   else
        BOARD_UART_PORT->MODER |= ( (GPIO_MODER_OUT << (BOARD_UART_CTSPINNUM*2)) \
                                  | (GPIO_MODER_OUT << (BOARD_UART_RTSPINNUM*2)) \
                                  | (GPIO_MODER_OUT << (BOARD_UART_RXPINNUM*2))  \
                                  | (GPIO_MODER_OUT << (BOARD_UART_TXPINNUM*2))  );
#   endif
    
    
    // External USB interface: keep alive in STOP
    
    
    // Accelerometer Interface using I2C2 (Port B)
    // Set I2C ports to HiZ
    //# BOARD_ACC_PORT->OTYPER     |= ( (1<<BOARD_ACC_SCLPIN) | (1<<BOARD_ACC_SDAPIN) );    //Open Drain
    //# BOARD_ACC_PORT->MODER      |= ( (GPIO_MODER_ALT << (BOARD_ACC_SCLPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_ACC_SDAPINNUM*2));
    
    
    // LCD interface on SPI 2 (currently disabled, set to output-gnd)
    // SD Card Interface on SPI2 (currently disabled)
    // LCD interface above already disabled SPI2, so just disable SD CSn
    
    //SPIRIT1 RF Interface, using SPI1 and some GPIOs
    //GPIO0-3 are floating inputs (default), SDN is 2MHz push-pull output
    
    // ground spi pins?
    BOARD_RFSPI_PORT->MODER    |= ( (GPIO_MODER_ALT << (BOARD_RFSPI_MOSIPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_RFSPI_MISOPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_RFSPI_CSNPINNUM*2)) );
    BOARD_RFSPI_PORT->OSPEEDR  |= ( (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_MOSIPINNUM*2)) \
                                  | (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_MISOPINNUM*2)) \
                                  | (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_SCLKPINNUM*2)) \
                                  | (GPIO_OSPEEDR_10MHz << (BOARD_RFSPI_CSNPINNUM*2)) );
    BOARD_RFSPI_PORT->AFR[1]     |= ( (5 << ((BOARD_RFSPI_MOSIPINNUM-8)*4)) \
                                  | (5 << ((BOARD_RFSPI_MISOPINNUM-8)*4)) \
                                  | (5 << ((BOARD_RFSPI_SCLKPINNUM-8)*4)) \
                                  | (5 << ((BOARD_RFSPI_CSNPINNUM-8)*4)) );
    
    // SPIRIT1 Current Monitor Interface: ???
    // PS input and RFV inputs are set by default
    //# BOARD_SCMOUT_PORT->MODER   |= ( (GPIO_MODER_ALT << (BOARD_SCMOUT_SCMENPINNUM*2)) \
                                  | (GPIO_MODER_ALT << (BOARD_SCMOUT_CMENPINNUM*2));
    
    
    // TIMER9 interrupt interface: Keep Alive
    
    // All not-connected pins are already at output ground
    // PA4, PA6, PA7, PA10;  PB5;  D5-15;  PE0, 1, 2, 11
}




///@note BOARD Macro for initializing the STM32 PVD Module (voltage monitor) at
///      startup.  Only relevant for battery-powered boards.
static inline void BOARD_POWER_STARTUP(void) {
#   if (MCU_FEATURE_SVMONITOR == ENABLED)
    // Level0 is 1.9V, each level is +0.2V.  Check your battery spec and change
    // the _LEVx component to match it.  Typical Li-Ion undervoltage is 2.7V.
    PWR->CR    |= PWR_CR_PLS_LEV0 | PWR_CR_PVDE;  
#   endif
}




///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  For any build using CMSIS libraries (standard), this will
///      be blank.  In those cases, crystal init is done in the CMSIS system
///      startup function.

static inline void BOARD_HSXTAL_ON(void) {
}

static inline void BOARD_HSXTAL_OFF(void) {
}


static inline void BOARD_USB_PORTENABLE(void) {
    //BOARD_USB_PORT->MODER  |= (GPIO_MODER_ALT << (BOARD_USB_DMPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_USB_DPPINNUM*2));
    SYSCFG->PMC            |= SYSCFG_PMC_USB_PU;
}

