jpnorair/OpenTag/include/board/stm32l1xx/board_IKR001.h
#if (OT_TRIG3_POLARITY != 0)
#   define OT_TRIG3_ON()    OT_TRIG3_PORT->BSRRL = OT_TRIG3_PIN;
#   define OT_TRIG3_OFF()   OT_TRIG3_PORT->BSRRH = OT_TRIG3_PIN;
#   define OT_TRIG3_TOG()   OT_TRIG3_PORT->ODR  ^= OT_TRIG3_PIN;
#else 
#   define OT_TRIG3_ON()    OT_TRIG3_PORT->BSRRH = OT_TRIG3_PIN;
#   define OT_TRIG3_OFF()   OT_TRIG3_PORT->BSRRL = OT_TRIG2_PIN;
#   define OT_TRIG3_TOG()   OT_TRIG3_PORT->ODR  ^= OT_TRIG3_PIN;
#endif

#if (OT_TRIG4_POLARITY != 0)
#   define OT_TRIG4_ON()    OT_TRIG4_PORT->BSRRL = OT_TRIG2_PIN;
#   define OT_TRIG4_OFF()   OT_TRIG4_PORT->BSRRH = OT_TRIG2_PIN;
#   define OT_TRIG4_TOG()   OT_TRIG4_PORT->ODR  ^= OT_TRIG2_PIN;
#else 
#   define OT_TRIG4_ON()    OT_TRIG4_PORT->BSRRH = OT_TRIG4_PIN;
#   define OT_TRIG4_OFF()   OT_TRIG4_PORT->BSRRL = OT_TRIG4_PIN;
#   define OT_TRIG4_TOG()   OT_TRIG4_PORT->ODR  ^= OT_TRIG4_PIN;
#endif

static inline void BOARD_led1_on(void)      { OT_TRIG1_ON(); }
static inline void BOARD_led1_off(void)     { OT_TRIG1_OFF(); }
static inline void BOARD_led1_toggle(void)  { OT_TRIG1_TOGGLE(); }
static inline void BOARD_led2_on(void)      { OT_TRIG2_ON(); }
static inline void BOARD_led2_off(void)     { OT_TRIG2_OFF(); }
static inline void BOARD_led2_toggle(void)  { OT_TRIG2_TOGGLE(); }



#define OT_SWITCH1_PORTNUM  BOARD_SW1_PORTNUM
#define OT_SWITCH1_PORT     BOARD_SW1_PORT
#define OT_SWITCH1_PINNUM   BOARD_SW1_PINNUM
#define OT_SWITCH1_PIN      BOARD_SW1_PIN
#define OT_SWITCH1_POLARITY BOARD_SW1_POLARITY

#define __ISR_EXTI6
#define OT_SWITCH1_ISR      platform_isr_exti6





// Use PA6 as floating pin for ADC-based random number.  You could also put on 
// a low voltage, reverse-biased zener on the board to produce a pile of noise 
// if you are getting low-entropy on your pin (2.1V zener usually is nice).
// Set OT_GWNDRV to enable such a zener setup.
#define OT_GWNADC_PORTNUM   0
#define OT_GWNADC_PORT      GPIOA
#define OT_GWNADC_PINNUM    6
#define OT_GWNADC_PIN       (1<<6)
#define OT_GWNADC_BITS      8

//#define OT_GWNDRV_PORTNUM   0
//#define OT_GWNDRV_PORT      GPIOA
//#define OT_GWNDRV_PINNUM    7
//#define OT_GWNDRV_PIN       (1<<7)






/** Boilerplate STM32L MPipe Setup <BR>
  * ========================================================================<BR>
  * USB MPipe requires a CDC firmware library subsystem, which typically uses
  * memcpy to move data across HW buffers and such.  UART MPipe *REQUIRES* a,
  * DMA however.  You could implement a driver without a DMA, but DMA makes it 
  * so much cleaner and better.
  */
#if (MCU_CONFIG_USB == ENABLED)
// USB is mostly independent from OT, but the startup code does need to know 
// how to boost the crystal
#   if (BOARD_PARAM_HFHz != 2000000) && (BOARD_PARAM_HFHz != 3000000) \
      && (BOARD_PARAM_HFHz != 4000000) && (BOARD_PARAM_HFHz != 6000000) \
      && (BOARD_PARAM_HFHz != 8000000) && (BOARD_PARAM_HFHz != 12000000) \
      && (BOARD_PARAM_HFHz != 16000000) && (BOARD_PARAM_HFHz != 24000000) \
      && (BOARD_PARAM_RFHz != 24000000) && (BOARD_PARAM_RFHz != 48000000)
#       error "USB requires 2, 3, 4, 6, 8, 12, 16, or 24 MHz HSE XTAL, or alternatively 24 or 48 MHz RF crystal."
#   endif
#   define MPIPE_USB_ID         0
#   define MPIPE_USB            USB0
#   define MPIPE_USBDP_PORT     BOARD_USB_PORT
#   define MPIPE_USBDM_PORT     BOARD_USB_PORT
#   define MPIPE_USBDP_PIN      BOARD_USB_DPPIN
#   define MPIPE_USBDM_PIN      BOARD_USB_DMPIN
#endif

#if (MCU_CONFIG_MPIPEUART == ENABLED)
#   define MPIPE_DMANUM         1
#   define MPIPE_DMA            DMA1
#   define MPIPE_UART_ID        BOARD_UART_ID
#   define MPIPE_UART_PORTNUM   BOARD_UART_PORTNUM
#   define MPIPE_UART_PORT      BOARD_UART_PORT
#   define MPIPE_UART_RXPIN     BOARD_UART_RXPIN
#   define MPIPE_UART_TXPIN     BOARD_UART_TXPIN
#   define MPIPE_RTS_PORT       BOARD_UART_PORT
#   define MPIPE_CTS_PORT       BOARD_UART_PORT
#   define MPIPE_RTS_PIN        BOARD_UART_RTSPIN
#   define MPIPE_CTS_PIN        BOARD_UART_CTSPIN
#   define MPIPE_UART_PINS      (MPIPE_UART_RXPIN | MPIPE_UART_TXPIN)

#   if (MPIPE_UART_ID == 1)
#       define MPIPE_UART       USART1
#       define MPIPE_DMA_RXCHAN_ID  5
#       define MPIPE_DMA_TXCHAN_ID  4
#       define __USE_DMA1_CHAN5
#       define __USE_DMA1_CHAN4

#   elif (MPIPE_UART_ID == 2)
#       define MPIPE_UART       USART2
#       define MPIPE_DMA_RXCHAN_ID  6
#       define MPIPE_DMA_TXCHAN_ID  7
#       define __USE_DMA1_CHAN7
#       define __USE_DMA1_CHAN6

#   elif (MPIPE_UART_ID == 3)
#       define MPIPE_UART       USART3
#       define MPIPE_DMA_RXCHAN_ID  3
#       define MPIPE_DMA_TXCHAN_ID  2
#       define __USE_DMA1_CHAN3
#       define __USE_DMA1_CHAN2

#   elif (MPIPE_UART_ID == 4)
#       define MPIPE_UART       UART4

#   elif (MPIPE_UART_ID == 5)
#       define MPIPE_UART       UART5

#   else
#       error "MPIPE_UART_ID is defined out of range"
#   endif
#endif







/** Boilerplate STM32L SPIRIT1-RF Setup <BR>
  * ========================================================================<BR>
  * The SPIRIT1 interface uses an SPI (ideally SPI1 because it is attached to
  * the high-speed APB2 bus).  It also typically uses a DMA for bulk transfers,
  * during which the core can be shut-off for reducing power.
  */
 
#define RADIO_SPI_ID    BOARD_RFSPI_ID
#if (BOARD_RFSPI_ID == 1)
#   define RADIO_SPI    SPI1
#   if (defined(__USE_DMA1_CHAN2) || defined(__USE_DMA1_CHAN3))
#       error "RADIO SPI is SPI1, which needs DMA Ch2 & Ch3, but they are used."
#   else
#       define __USE_DMA1_CHAN2
#       define __USE_DMA1_CHAN3
#       define __N_ISR_DMA1_Channel2
#       define __N_ISR_DMA1_Channel3
#   endif
#elif (BOARD_RFSPI_ID == 2)
#   define RADIO_SPI    SPI2
#   if (defined(__USE_DMA1_CHAN4) || defined(__USE_DMA1_CHAN5))
#       error "RADIO SPI is SPI2, which needs DMA Ch4 & Ch5, but they are used."
#   else
#       define __USE_DMA1_CHAN4
#       define __USE_DMA1_CHAN5
#       define __N_ISR_DMA1_Channel4
#       define __N_ISR_DMA1_Channel5
#   endif
#else
#   error "RADIO_SPI must be 1 or 2"
#endif

#define RADIO_SPI_PORT              BOARD_RFSPI_PORT
#define RADIO_SPIMOSI_PORT          BOARD_RFSPI_PORT
#define RADIO_SPIMISO_PORT          BOARD_RFSPI_PORT
#define RADIO_SPICLK_PORT           BOARD_RFSPI_PORT
#define RADIO_SPICS_PORT            BOARD_RFSPI_PORT
#define RADIO_SPIMOSI_PIN           BOARD_RFSPI_MOSIPIN
#define RADIO_SPIMISO_PIN           BOARD_RFSPI_MISOPIN
#define RADIO_SPICLK_PIN            BOARD_RFSPI_SCLKPIN
#define RADIO_SPICS_PIN             BOARD_RFSPI_CSNPIN

#define RADIO_IRQ0_SRCPORT          BOARD_RFGPIO_PORTNUM
#define RADIO_IRQ1_SRCPORT          BOARD_RFGPIO_PORTNUM
#define RADIO_IRQ2_SRCPORT          BOARD_RFGPIO_PORTNUM
#define RADIO_IRQ3_SRCPORT          BOARD_RFGPIO_PORTNUM
#define RADIO_IRQ0_SRCLINE          BOARD_RFGPIO_0PINNUM
#define RADIO_IRQ1_SRCLINE          BOARD_RFGPIO_1PINNUM
#define RADIO_IRQ2_SRCLINE          BOARD_RFGPIO_2PINNUM
#define RADIO_IRQ3_SRCLINE          -1

#define RADIO_SDN_PORT              BOARD_RFCTL_PORT
#define RADIO_IRQ0_PORT             BOARD_RFGPIO_PORT
#define RADIO_IRQ1_PORT             BOARD_RFGPIO_PORT
#define RADIO_IRQ2_PORT             BOARD_RFGPIO_PORT
#define RADIO_IRQ3_PORT             BOARD_RFCTL_PORT
#define RADIO_SDN_PIN               BOARD_RFCTL_SDNPIN
#define RADIO_IRQ0_PIN              BOARD_RFGPIO_0PIN
#define RADIO_IRQ1_PIN              BOARD_RFGPIO_1PIN
#define RADIO_IRQ2_PIN              BOARD_RFGPIO_2PIN
#define RADIO_IRQ3_PIN              BOARD_RFCTL_3PIN





/** Boilerplate STM32L DMA Memcpy Setup <BR>
  * ========================================================================<BR>
  * Memcpy should have a low DMA priority, such as Channel7.  It is a MEM2MEM
  * function of the DMA, so it can take any channel.  If there is another user
  * of DMA Channel 7, then the potential throughput of that communication
  * interface is limited by the duty time of memcpy.
  */
#if (MCU_CONFIG_MEMCPYDMA != ENABLED)
#   error "Not using DMA for MEMCPY, a sub-optimal design choice."
#elif !defined(__USE_DMA1_CHAN7)
#   define MEMCPY_DMA_CHAN_ID 7
#   define MEMCPY_DMA       DMA1
#   define MEMCPY_DMACHAN   DMA1_Channel7
#   define __USE_DMA1_CHAN7
#elif !defined(__USE_DMA1_CHAN6)
#   define MEMCPY_DMA_CHAN_ID    6
#   define MEMCPY_DMA       DMA1
#   define MEMCPY_DMACHAN   DMA1_Channel6
#   define __USE_DMA1_CHAN6
#elif !defined(__USE_DMA1_CHAN5)
#   define MEMCPY_DMA_CHAN_ID    5
#   define MEMCPY_DMA       DMA1
#   define MEMCPY_DMACHAN   DMA1_Channel5
#   define __USE_DMA1_CHAN5
#elif !defined(__USE_DMA1_CHAN4)
#   define MEMCPY_DMA_CHAN_ID    4
#   define MEMCPY_DMA       DMA1
#   define MEMCPY_DMACHAN   DMA1_Channel4
#   define __USE_DMA1_CHAN4
#elif !defined(__USE_DMA1_CHAN3)
#   define MEMCPY_DMA_CHAN_ID    3
#   define MEMCPY_DMA       DMA1
#   define MEMCPY_DMACHAN   DMA1_Channel3
#   define __USE_DMA1_CHAN3
#elif !defined(__USE_DMA1_CHAN2)
#   define MEMCPY_DMA_CHAN_ID    2
#   define MEMCPY_DMA       DMA1
#   define MEMCPY_DMACHAN   DMA1_Channel2
#   define __USE_DMA1_CHAN2
#elif !defined(__USE_DMA1_CHAN1)
#   define MEMCPY_DMA_CHAN_ID    1
#   define MEMCPY_DMA       DMA1
#   define MEMCPY_DMACHAN   DMA1_Channel1
#   define __USE_DMA1_CHAN1
#else
#   error "There is no available DMA Channel to allocate to MEMCPY."
#endif






/** EXTI Line Utilization declaration <BR>
  * ========================================================================<BR>
  * EXTI Lines (external line interrupts coming from GPIO pins) are shared
  * by all GPIO ports, so setting them up correctly is a bit of a mess.  We
  * need to inspect all the external interrupt sources.
  */
#if (!defined(__USE_EXTI0) && ( \
        (OT_SWITCH1_PINNUM == 0) || \
        (RADIO_IRQ0_SRCLINE == 0) || (RADIO_IRQ1_SRCLINE == 0) || (RADIO_IRQ2_SRCLINE == 0) || (RADIO_IRQ3_SRCLINE == 0) \
    ))
#   define __USE_EXTI0
#endif
#if (!defined(__USE_EXTI1) && ( \
        (OT_SWITCH1_PINNUM == 1) || \
        (RADIO_IRQ0_SRCLINE == 1) || (RADIO_IRQ1_SRCLINE == 1) || (RADIO_IRQ2_SRCLINE == 1) || (RADIO_IRQ3_SRCLINE == 1) \
    ))
#   define __USE_EXTI1
#endif
#if (!defined(__USE_EXTI2) && ( \
        (OT_SWITCH1_PINNUM == 2) || \
        (RADIO_IRQ0_SRCLINE == 2) || (RADIO_IRQ1_SRCLINE == 2) || (RADIO_IRQ2_SRCLINE == 2) || (RADIO_IRQ3_SRCLINE == 2) \
    ))
#   define __USE_EXTI2
#endif
#if (!defined(__USE_EXTI3) && ( \
        (OT_SWITCH1_PINNUM == 3) || \
        (BOARD_FEATURE_MPIPE_BREAK && (BOARD_UART_RXPINNUM == 3)) || \
        (RADIO_IRQ0_SRCLINE == 3) || (RADIO_IRQ1_SRCLINE == 3) || (RADIO_IRQ2_SRCLINE == 3) || (RADIO_IRQ3_SRCLINE == 3) \
    ))
#   define __USE_EXTI3
#endif
#if (!defined(__USE_EXTI4) && ( \
        (OT_SWITCH1_PINNUM == 4) || \
        (RADIO_IRQ0_SRCLINE == 4) || (RADIO_IRQ1_SRCLINE == 4) || (RADIO_IRQ2_SRCLINE == 4) || (RADIO_IRQ3_SRCLINE == 4) \
    ))
#   define __USE_EXTI4
#endif
#if (!defined(__USE_EXTI5) && ( \
        (OT_SWITCH1_PINNUM == 5) || \
        (RADIO_IRQ0_SRCLINE == 5) || (RADIO_IRQ1_SRCLINE == 5) || (RADIO_IRQ2_SRCLINE == 5) || (RADIO_IRQ3_SRCLINE == 5) \
    ))
#   define __USE_EXTI5
#endif
#if (!defined(__USE_EXTI6) && ( \
        (OT_SWITCH1_PINNUM == 6) || \
        (RADIO_IRQ0_SRCLINE == 6) || (RADIO_IRQ1_SRCLINE == 6) || (RADIO_IRQ2_SRCLINE == 6) || (RADIO_IRQ3_SRCLINE == 6) \
    ))
#   define __USE_EXTI6
#endif
#if (!defined(__USE_EXTI7) && ( \
        (OT_SWITCH1_PINNUM == 7) || \
        (RADIO_IRQ0_SRCLINE == 7) || (RADIO_IRQ1_SRCLINE == 7) || (RADIO_IRQ2_SRCLINE == 7) || (RADIO_IRQ3_SRCLINE == 7) \
    ))
#   define __USE_EXTI7
#endif
#if (!defined(__USE_EXTI8) && ( \
        (OT_SWITCH1_PINNUM == 8) || \
        (RADIO_IRQ0_SRCLINE == 8) || (RADIO_IRQ1_SRCLINE == 8) || (RADIO_IRQ2_SRCLINE == 8) || (RADIO_IRQ3_SRCLINE == 8) \
    ))
#   define __USE_EXTI8
#endif
#if (!defined(__USE_EXTI9) && ( \
        (OT_SWITCH1_PINNUM == 9) || \
        (RADIO_IRQ0_SRCLINE == 9) || (RADIO_IRQ1_SRCLINE == 9) || (RADIO_IRQ2_SRCLINE == 9) || (RADIO_IRQ3_SRCLINE == 9) \
    ))
#   define __USE_EXTI9
#endif
#if (!defined(__USE_EXTI10) && ( \
        (OT_SWITCH1_PINNUM == 10) || \
        (RADIO_IRQ0_SRCLINE == 10) || (RADIO_IRQ1_SRCLINE == 10) || (RADIO_IRQ2_SRCLINE == 10) || (RADIO_IRQ3_SRCLINE == 10) \
    ))
#   define __USE_EXTI10
#endif
#if (!defined(__USE_EXTI11) && ( \
        (OT_SWITCH1_PINNUM == 11) || \
        (RADIO_IRQ0_SRCLINE == 11) || (RADIO_IRQ1_SRCLINE == 11) || (RADIO_IRQ2_SRCLINE == 11) || (RADIO_IRQ3_SRCLINE == 11) \
    ))
#   define __USE_EXTI11
#endif
#if (!defined(__USE_EXTI12) && ( \
        (OT_SWITCH1_PINNUM == 12) || \
        (RADIO_IRQ0_SRCLINE == 12) || (RADIO_IRQ1_SRCLINE == 12) || (RADIO_IRQ2_SRCLINE == 12) || (RADIO_IRQ3_SRCLINE == 12) \
    ))
#   define __USE_EXTI12
#endif
#if (!defined(__USE_EXTI13) && ( \
        (OT_SWITCH1_PINNUM == 13) || \
        (RADIO_IRQ0_SRCLINE == 13) || (RADIO_IRQ1_SRCLINE == 13) || (RADIO_IRQ2_SRCLINE == 13) || (RADIO_IRQ3_SRCLINE == 13) \
    ))
#   define __USE_EXTI13
#endif
#if (!defined(__USE_EXTI14) && ( \
        (OT_SWITCH1_PINNUM == 14) || \
        (RADIO_IRQ0_SRCLINE == 14) || (RADIO_IRQ1_SRCLINE == 14) || (RADIO_IRQ2_SRCLINE == 14) || (RADIO_IRQ3_SRCLINE == 14) \
    ))
#   define __USE_EXTI14
#endif
#if (!defined(__USE_EXTI15) && ( \
        (OT_SWITCH1_PINNUM == 15) || \
        (RADIO_IRQ0_SRCLINE == 15) || (RADIO_IRQ1_SRCLINE == 15) || (RADIO_IRQ2_SRCLINE == 15) || (RADIO_IRQ3_SRCLINE == 15) \
    ))
#   define __USE_EXTI15
#endif



//Wipe-out some temporary constants which have generic names
#undef _DMACLK_N
#undef _FLITFCLK_N
#undef _CRCCLK_N
#undef _GPIOCLK_SU
#undef _GPIOCLK_N
#undef _DMACLK_LP
#undef _SRAMCLK_LP
#undef _FLITFCLK_LP
#undef _CRCCLK_LP
#undef _GPIOCLK_LP




#endif
